test_cases/pollutant_komegasst/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
       type            totalPressure;
        p0              uniform 0;
        gamma           1.4;
        value           uniform 0;
    }

    ground
    {
        type            zeroGradient;
    }
 building
    {
        type            zeroGradient;
    }
    
   
    frontAndBack
    {
        type            symmetry;
    }


    
}

// ************************************************************************* //
