test_cases/pollutant_komegasst/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Cmu^0.75 * k^1.5 / L ; L =10

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1.78;

boundaryField
{
 #include        "include/ABLConditions"

    inlet
    {
        type            atmBoundaryLayerInletOmega;
        #include        "include/ABLConditions"
        value           uniform 0;
    }

    ground
    {
        type            omegaWallFunction;
        Cmu             $Cmu;
        kappa           $kappa;
        value           $internalField;
    }
    

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    building
    {
       type            omegaWallFunction;
        Cmu             $Cmu;
        kappa           $kappa;
        value           $internalField;
    }
    
   
    frontAndBack
    {
        type            symmetry;
    }

   
}

// ************************************************************************* //
