test_cases/pollutant_komegasst/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication ./Allrun.pre

restore0Dir

#runApplication $(getApplication)

#------------------------------------------------------------------------------
